text_start_manage_stats = "<b>Управление отчетами:</b> (шаг 1)\n\n" \
                          "📑 Выберите отчет, к которому нужно определить доступы сотрудникам."
text_choose_observers_stats = "<b>Управление отчетами:</b> (шаг 2)\n\n"\
                              f"👨‍💼 Выберите сотрудников, которым будет виден выбранный отчет.\n" \
                              f"<i>(сотрудники, которые уже видят этот отчет - помечены флажком)</i>"
text_end_change_observers_p_stats = "Список наблюдателей отчета изменен успешно ✅"
