text_start_manage_reports_requests = "<b>Алгоритм запроса в подотчет:</b> (шаг 1)\n\n" \
                                     "👨‍✈️ Выберите роль, на которую нужно распределить сотрудников для запроса в подотчет.\n\n" \
                                     "⚠️<i> Важно: при изменении ролей, все запросы в подотчет, проходящие этапы согласования, " \
                                     "утверждения и т.д. - будут анулированы!</i>"
alert_text_error_load_users_list = "🆘 Похоже что все пользователи распределены на другие роли"
