text_get_list_payment_accounts = f"Здесь вы можете настроить расчётные счета выбранного банка.\n\n" \
                                 f"<u>Кнопки управления</u>:\n\n" \
                                 f"⬅️ - вернуться к списку банков\n" \
                                 f"➕ - добавить расчётный счет\n" \
                                 f"❌️ - удалить расчётные счета\n\n"
text_start_add_payment_account = f"<b>ШАГ</b> 1️⃣️\n\n" \
                                 f"<u>Введите данные расчтётного счета:</u>\n" \
                                 f"1. <b>Номер</b> - номер расчётного счета\n" \
                                 f"2. <b>Дата стартовой отгрузки</b> - дата стартовой отгрузки выписок" \
                                 f" (не ранее начала текущего года, формат год-месяц-день)\n\n" \
                                 f"<b>Пример (просто нажмите👇):</b>\n<code>120400301202\n2023-01-01</code>"
text_select_payment_account_organization = f"<b>ШАГ</b> 2️⃣\n\n" \
                                           f"Выберите ЮР Лицо, к которому нужно прикрепить этот расчетный счет ⤵️"
text_end_add_payment_account = f"Расчётный счет успешно добавлен в систему ✅"
text_start_delete_partners = "\nВыберите контрагентов, которых нужно удалить 👉"
text_end_delete_partners = "Контрагенты удалены успешно ✅"
text_wrong_datetime = "Похоже дата задана не верно 🙅‍♂️"
