text_get_list_organizations = f"<b>ШАГ</b> 2️⃣\n" \
                              f"Здесь вы можете настроить ЮР Лица вашего бота Управляйки.\n\n" \
                              f"<u>Кнопки управления</u>:\n\n" \
                              f"➕ - добавить ЮР Лицо\n" \
                              f"❌️ - удалить ЮР Лица\n\n" \
                              f"Для того чтобы изменить параметры ЮР Лица, нажмите на него 👉\n\n" \
                              f"<u>Статус ЮР Лица</u>:\n" \
                              f"(если скрыть Юр Лицо, ее видимость в боте пропадет для всех " \
                              f"ваших сотрудников, включая видимость дочерних категорий)\n\n" \
                              f"💤 - скрыта\n\n"
text_start_add_organization = f"\nВведите данные ЮР Лица 🆕⤵️:\n" \
                              f"1️⃣️ ИНН\n" \
                              f"2️⃣ Название ЮР Лица\n\n" \
                              f"<b>Пример:</b>\n<code>120400301202\nООО Открытие</code>"
text_choose_observers_organization = f"\nВыберите сотрудников, которые смогут видеть это ЮР Лицо"
text_end_add_organization = f"ЮР Лицо успешно добавлено в систему ✅"
text_choose_param_to_change_organization = "\nВыберите, что хотите изменить у ЮР Лица 📊⤵️"
text_change_name_organization = f"\nВведите новые данные ЮР Лица 🆕⤵️:\n" \
                                f"1️⃣️ ИНН\n" \
                                f"2️⃣ Название ЮР Лица\n\n (Данные выбранного ЮР Лица указаны в примере, " \
                                f"нажмите чтобы скопировать 👉)\n\n"
text_end_change_organization = f"Параметры ЮР Лица изменены успешно ✅"
text_end_change_observers_organization = f"Наблюдатели ЮР Лица изменены успешно ✅"
text_start_delete_organizations = "\nВыберите ЮР Лица, которые нужно удалить 👉"
text_stop_delete_organizations = "Операция удаления отменена ❎"
text_end_delete_organizations = "ЮР Лица удалены успешно ✅"

