text_get_list_banks = f"<b>Банки</b>\n\n" \
                      f"🏦 Здесь вы можете настроить банки вашего бота Управляйки.\n\n" \
                      f"<i>👉 Нажмите на банк, чтобы открыть прикрепленные к нему расчётные счета.</i>\n\n" \
                      f"<u>Кнопки управления</u>:\n" \
                      f"➕ - добавить банк\n" \
                      f"❌️ - удалить банки"

text_start_add_bank = f"<b>Добавление банка:</b> (шаг 1)\n\n" \
                      f"<u>Введите данные банка:</u>\n" \
                      f"<b>Название</b> - ваше наименование для банка\n" \
                      f"<b>Апи ключ</b> - токен для доступа к выпискам банка " \
                      f"<i>(за инструкцией по настройке обратитесь к менеджерам)</i>\n\n" \
                      f"<b>Пример </b><i>(просто нажмите 👇)</i>:\n<code>Банк Коли\nggdg3t3gash353thg</code>"
text_select_bank_name = f"<b>Добавление банка:</b> (шаг 2)\n\n" \
                        f"👉 Выберите отделение банка.\n"
text_end_add_bank = f"Банк успешно добавлен в систему ✅"
text_start_delete_banks = "<b>Удаление банков</b>\n\n" \
                          "👉 Выберите банки, которых нужно удалить."
text_end_delete_banks = "Банки удалены успешно ✅"
