text_get_list_payment_accounts = f"Здесь вы можете настроить расчётные счета выбранного банка.\n\n" \
                                 f"<u>Кнопки управления</u>:\n" \
                                 f"⬅️ - вернуться к списку банков\n" \
                                 f"➕ - добавить расчётный счет\n" \
                                 f"❌️ - удалить расчётные счета"
text_start_add_payment_account = f"<b>Добавление расчётного счета:</b> (шаг 1)\n\n" \
                                 f"<u>Введите данные расчётного счета:</u>\n" \
                                 f"<b>Номер</b> - номер расчётного счета\n" \
                                 f"<b>Дата стартовой отгрузки</b> - дата стартовой отгрузки выписок" \
                                 f" <i>(не ранее начала текущего года, формат год-месяц-день)</i>\n\n" \
                                 f"<b>Пример </b><i>(просто нажмите 👇)</i>:\n<code>120400301202\n2023-01-01</code>"
text_select_payment_account_organization = f"<b>Добавление расчётного счета:</b> (шаг 2)\n\n" \
                                           f"👉 Выберите ЮР Лицо, к которому нужно прикрепить этот расчетный счет."
text_end_add_payment_account = f"Расчётный счет успешно добавлен в систему ✅"
text_start_delete_payment_accounts = "<b>Удаление расчётных счетов</b>\n\n" \
                                     "👉 Выберите расчётные счета, которые нужно удалить."
text_end_delete_payment_accounts = "Расчётные счета удалены успешно ✅"
text_wrong_datetime = "Похоже дата задана не верно 🙅‍♂️"
