text_get_list_banks = f"Здесь вы можете настроить банки вашего бота Управляйки.\n\n" \
                      f"<u>Кнопки управления</u>:\n\n" \
                      f"➕ - добавить банк\n" \
                      f"❌️ - удалить банки\n\n" \
                      f"Нажмите на банк, чтобы открыть прикрепленные к нему расчётные счета 👉"
text_start_add_bank = f"<b>ШАГ</b> 1️⃣️\n\n" \
                      f"Введите данные банка:\n" \
                      f"1. <b>Название</b> - ваше наименование для банка\n" \
                      f"2. <b>Апи ключ</b> - токен для доступа к выпискам банка " \
                      f"(за инструкцией по настройке обратитесь к менеджерам)\n\n" \
                      f"<b>Пример (просто нажмите 👇):</b>\n<code>Банк Коли\nggdg3t3gash353thg</code>"
text_select_bank_name = f"<b>ШАГ</b> 2️⃣\n\n" \
                        f"Выберите отделение банка ⤵️\n"
text_end_add_bank = f"Банк успешно добавлен в систему ✅"
text_start_delete_banks = "\nВыберите банки, которых нужно удалить 👉"
text_end_delete_banks = "Банки удалены успешно ✅"
