text_get_list_categories = f"<b>Категории</b>\n\n" \
                           f"📋 Здесь вы можете настроить категории доходов и расходов на разных уровнях " \
                           f"вложенности, для последующего внесения их в вашу гугл таблицу.\n\n" \
                           f"<u>Кнопки управления</u>:\n" \
                           f"⬅️ - вернуться на уровень выше\n" \
                           f"➕ - добавить категорию на уровень\n" \
                           f"✏️ - редактировать категории\n" \
                           f"❌️ - удалить категории\n\n" \
                           f"👉 <i>Для перехода на уровень ниже, нажмите на нужную категорию. </i>\n\n" \
                           f"<u>Статус категории</u>:\n" \
                           f"<i>(если скрыть категорию, ее видимость в боте пропадет для всех " \
                           f"пользователей, включая дочерние)</i>\n" \
                           f"💤 - скрыта\n\n"
text_start_add_menu_item_ur_face = f"\nВведите название нового ЮР Лица 🆕👇:"
text_choose_observers_menu_item_ur_face = f"\nТеперь выберите сотрудников, которые смогут видеть это Юр Лицо"
text_end_add_menu_item_ur_face = f"Юр Лицо успешно добавлено в систему ✅"
text_start_add_menu_item = f"\n👉 Введите название новой категории."
text_choose_observers_menu_item = f"\n👨‍💼 Теперь выберите сотрудников, которые смогут видеть эту категорию."
text_end_add_menu_item = f"Категория успешно добавлена в систему ✅"
text_choose_param_to_change_menu_item = "\n👉 Выберите параметр, который хотите изменить в этой категории."
text_start_change_menu_item = "\n👉 Нажмите на категорию, который нужно изменить."
text_change_name_menu_item = f"\nВведите новое название категории 🆕👇:"
text_end_change_name_menu_item = f"Название категории изменено успешно ✅"
text_start_change_observers_menu_item = f"\n👨‍💼 Выберите пользователей, которым будет видна выбранная категория."
text_end_change_observers_menu_item = f"Наблюдатели категории изменены успешно ✅"
text_start_delete_menu_item = "\n👉 Выберите категории, которые нужно удалить."
text_stop_delete_menu_item = "Операция удаления отменена ⛔️"
text_end_delete_menu_item = "Пункты меню удалены успешно ✅"
text_stop_delete_u = "Операция по анулированию доступов отменена ❎"
text_end_delete_u = "Пользователи удалены из бота ✅"
