text_get_list_partners = f"<b>ШАГ</b> 4️⃣\n" \
                         f"Здесь вы можете настроить контрагентов вашего бота Управляйки.\n\n" \
                         f"<u>Кнопки управления</u>:\n\n" \
                         f"➕ - добавить контрагента\n" \
                         f"❌️ - удалить контрагентов\n\n"
text_start_add_partner = f"\nВведите данные контрагента 🆕⤵️:\n" \
                         f"1️⃣️ ИНН\n" \
                         f"2️⃣ Название ЮР Лица\n\n" \
                         f"<b>Пример:</b>\n<code>120400301202\nООО Открытие</code>"