text_get_list_partners = f"<b>Контрагенты</b>\n\n" \
                         f"💼 Здесь вы можете настроить контрагентов вашего бота Управляйки.\n\n" \
                         f"<u>Кнопки управления</u>:\n" \
                         f"➕ - добавить контрагента\n" \
                         f"❌️ - удалить контрагентов\n\n"
text_start_add_partner = f"<b>Добавление контрагента:</b> (шаг 1)\n\n" \
                         f"<u>Введите данные контрагента:</u>\n" \
                         f"<b>ИНН</b> - в формате числа\n" \
                         f"<b>Наименование</b> - в формате строки\n\n" \
                         f"<b>Пример:</b>\n<code>120400301202\nООО Открытие</code>"
text_select_bank_reload_category = f"<b>Добавление контрагента:</b> (шаг 2)\n\n" \
                                   f"🗂 Выберите категорию, к которой нужно прикрепить этого контрагента.\n\n" \
                                   f"<u>Список очередей категорий:</u>\n" \
                                   f"<i>(соотнесите категорию по номеру в кнопке)</i>\n"
text_start_distribute_statement_operations = f"🧐 Смотрю, можно ли распределить доходы и\nрасходы по этим параметрам.\n" \
                                             f"<i>(Если найду, то распределю, если нет, то ваши " \
                                             f"операции из выписок распределятся при следующей подгрузке)</i>"
text_error_add_partner = f"⛔️ Контрагент по заданному ИНН уже зарегистрирован"
text_end_add_partner = f"✅ Контрагент успешно добавлен в систему"
text_start_delete_partners = f"<b>Удаление контрагентов</b>\n\n" \
                             f"👉 Выберите контрагентов, которых нужно удалить."
text_end_delete_partners = "Контрагенты удалены успешно ✅"
