text_get_list_partners = f"Здесь вы можете настроить контрагентов вашего бота Управляйки.\n\n" \
                         f"<u>Кнопки управления</u>:\n\n" \
                         f"➕ - добавить контрагента\n" \
                         f"❌️ - удалить контрагентов\n\n"
text_start_add_partner = f"<b>ШАГ</b> 1️⃣️\n" \
                         f"<b>Введите данные контрагента:</b>\n" \
                         f"1. ИНН\n" \
                         f"2. Наименование\n\n" \
                         f"<b>Пример:</b>\n<code>120400301202\nООО Открытие</code>"
text_select_bank_reload_category = f"<b>ШАГ</b> 2️⃣\n" \
                                   f"Выберите категорию, к которой нужно прикрепить этого контрагента ⤵️\n\n" \
                                   f"<b>Список очередей категорий:</b>\n" \
                                   f"(соотнесите категорию по номеру в кнопке)\n\n"
text_start_distribute_statement_operations = f"Смотрю, можно ли распределить доходы и расходы по этим параметрам 🧐" \
                                             f"<i>(Если найду, то распределю, если нет, то ваши " \
                                             f"операции из выписок распределятся при следующей подгрузке)</i>"
text_end_add_partner = f"Контрагент успешно добавлен в систему ✅"
text_start_delete_partners = "\nВыберите контрагентов, которых нужно удалить 👉"
text_end_delete_partners = "Контрагенты удалены успешно ✅"
