text_success_join_bot_to_group = f"Похоже меня добавили в группу. Здравствуйте, коллеги," \
                                 f" я - <b>Бот Управляйка</b> 🙎‍♂️👋\n\n" \
                                 f"Вижу приглашение отправлено от одного из пользователей, зарегистрированный " \
                                 f"в моей системе. \nОкей, уведомления о новых операциях вашей организации буду " \
                                 f"присылать в этот чат 💬"
text_repeat_add = f"Я уже прикреплен к другой группе, чтобы "
