text_start_request_money_report = "<b>Запрос денег в подотчет</b>\n\n" \
                                  "💷 Укажите сумму и комментарий к запрашиваемому расходу\n" \
                                  "<i>(Каждый параметр вводите с новой строки, можете нажать на пример, чтобы скопировать)</i>\n\n" \
                                  "<i>⚠️ Важно: если администратор уберет из списка всех согласующих, " \
                                  "или утверждающего и тп. или пройдет 24 часа после формирования," \
                                  "ваш запрос будет аннулирован и его придется продублировать ⚠️</i>\n\n" \
                                  "<b>Пример:</b>\n<code>242525\nНужны деньги</code>" \

text_send_request_to_agreement = "Запрос отправлен на согласование ✅" \
