text_start_request_money_report = "<b>Запрос денег в подотчет</b>\n\n" \
                                  "💷 Укажите сумму и комментарий к запрашиваемому расходу\n" \
                                  "<i>(Каждый параметр вводите с новой строки, можете нажать на пример, чтобы скопировать)</i>\n\n" \
                                  "<i>⚠️ Важно: через 24 часа после формирования," \
                                  "ваш запрос будет аннулирован и его придется продублировать</i>\n\n" \
                                  "<b>Пример:</b>\n<code>242525\nНужны деньги</code>"
text_send_request_to_agreement = "Запрос отправлен на согласование ✅"
text_no_all_roles_on_request = "⛔️ Администратор не назначил все роли для алгоритма запроса средств в подотчет."
text_get_list_notify_types_user = "<b>Категории уведомлений</b>\n\n" \
                                  "👉 Выберите категорию, чтобы отобразить список уведомлений\n" \
                                  "<i>(Рядом с категорией указано кол-во уведомлений, символ - '🔻' означает" \
                                  ", что есть не подтвержденные уведомления)</i>"
