text_get_user_list_mi = f"<b>Операция с категориями:</b> (шаг 3)\n\n" \
                        f"Задайте нужную очередь категорий для внесения новой записи в бд.\n\n" \
                        f"<u>Кнопки управления</u>:\n" \
                        f"<b>Назад ⬅️</b> - вернуться на уровень выше\n" \
                        f"<b>Расход ➖</b> - новая запись о расходе\n" \
                        f"<b>Доход ➕</b> - новая запись о доходе\n\n" \
                        f"<i>⤵️ Для перехода на уровень меню ниже, нажмите на нужную категорию.</i>\n\n"
text_no_menu_items_u = f"Вы добавлены в бот, но похоже админ еще не назначил доступные для вас категории 🙅‍♀️"
text_start_add_mi_to_bd = f"<b>Операция с категориями:</b> (шаг 4)\n\n💵 Введите сумму операции в рублях, " \
                          f"в формате числа.\n\n<b>Пример:</b>\n<code>987654</code>"
text_choose_bank = f"<b>Операция с категориями:</b> (шаг 5)\n\n🏦 Выберите банк, по которому произведена " \
                   f"операция.\n<i>(также можно выбрать способ оплаты наличными)</i> \n"
text_invalid_volume_operation = "Некорректная сумма. Введите число 💯"
text_send_check_photo = "<b>Операция с категориями:</b> (шаг 6)\n\n🖼️ Перетащите в чат фото чека, либо нажмите - '📎' " \
                        "чтобы прикрепить файл.\n" \
                        "<i>(фото можно прислать в сжатом виде или в виде файла)</i>"
text_invalid_check_photo = "Похоже вы отправили не фото 🤷‍♂️"
text_end_add_mi_to_bd = f"Запись успешно добавлена в лист БД ✅\n" \
                        f"<i>(чеки и таблицу можно посмотреть в вашем\nхранилище google drive)</i>\n"
text_choose_sender_write_item = "<b>Операция с категориями:</b> (шаг 1)\n\n👉 Выберите имя исполнителя операции."
text_choose_organizations = "<b>Операция с категориями:</b> (шаг 2)\n\n👉 Выберите ЮР Лицо."
text_no_menu_items_orgs = f"Вы добавлены в бот, но похоже админ еще не назначил доступные для вас ЮР Лица 🙅‍♀️"
