text_start_transfer = "<b>Перевод на кошелек:</b> (шаг 1)\n\n👉 Выберите ЮР Лицо из списка"
text_set_volume_transfer = "<b>Перевод на кошелек:</b> (шаг 2)\n\n💵 Укажите сумму в рублях в формате числа.\n\n" \
                           "<b>Пример:</b>\n<code>12455</code>"
text_select_wallet_sender = "<b>Перевод на кошелек:</b> (шаг 3)\n\n👉 Выберите кошелек с которого нужно вывести деньги."
text_select_wallet_recipient = "<b>Перевод на кошелек:</b> (шаг 4)\n\n👉 Выберите кошелек для пополнения."
text_end_transfer = "Запись о переводе внесена успешно ✅"
