text_get_user_list_mi = f"<b>ШАГ</b> 3️⃣:\n" \
                        f"Задайте нужную очередь категорий для внесения новой записи в бд.\n\n" \
                        f"<u>Кнопки управления</u>:\n\n" \
                        f"Назад ⬅️ - вернуться на уровень выше\n" \
                        f"Расход ➖ - новая запись о расходе\n" \
                        f"Доход ➕ - новая запись о доходе\n\n" \
                        f"Для перехода на уровень меню ниже, нажмите на нужную категорию 👉\n\n"
text_no_menu_items_u = f"Вы добавлены в бот, но похоже админ еще не назначил доступные для вас категории 🙅‍♀️"
text_start_add_mi_to_bd = f"<b>ШАГ</b> 4️⃣:\nВведите сумму операции в рублях, в формате числа 💵\n<b>Пример</b>:" \
                          f"\n<code>987654</code>"
text_choose_bank = f"<b>ШАГ</b> 5️⃣:\nВыберите банк, по которому произведена " \
                   f"операция 🏦 (либо способ оплаты наличными): \n"
text_invalid_volume_operation = "Некорректная сумма. Введите число 💯"
text_send_check_photo = "<b>ШАГ</b> 6️⃣:\nПеретащите в чат фото чека 🖼️\n(в сжатом виде или в виде файла)" \
                        "\n\n Либо нажмите - 📎 чтобы прикрепить файл."
text_invalid_check_photo = "Похоже вы отправили не фото 🤷‍♂️"
text_end_add_mi_to_bd = f"Запись успешно добавлена в лист БД ✅\n" \
                        f"Чеки и таблицу можно посмотреть в вашем хранилище google drive.\n"
text_choose_sender_write_item = "<b>ШАГ</b> 1️⃣:\nВыберите имя исполнителя операции 👇"
text_choose_organizations = "<b>ШАГ</b> 2️⃣:\nВыберите ЮР Лицо 👉⤵️"
text_no_menu_items_orgs = f"Вы добавлены в бот, но похоже админ еще не назначил доступные для вас ЮР Лица 🙅‍♀️"
