text_start_return_issuance = "<b>Возврат подотчета:</b> (шаг 1)\n\n👉 Выберите ЮР Лицо из списка"
text_set_volume_return_issuance = "<b>Возврат подотчета:</b> (шаг 2)" \
                                  "\n\n💵 Укажите сумму в рублях в формате числа\n\n"\
                                  "<b>Пример:</b>\n<code>12455</code>"
text_select_payment_method_return_issuance = "<b>Возврат подотчета:</b> (шаг 3)\n\n👉 Выберите кошелек"
text_end_return_issuance = "Запись о возврате подотчетных средств внесена успешно ✅"
