text_start_issuance = "<b>Выдача в подотчет:</b> (шаг 1)\n\n👉 Выберите ЮР Лицо из списка"
text_select_worker_issuance = "<b>Выдача в подотчет:</b> (шаг 2)" \
                              "\n\n👉 Выберите сотрудника для выдачи под отчет"
text_set_volume_issuance = "<b>Выдача в подотчет:</b> (шаг 3)" \
                           "\n\n💵 Укажите сумму в рублях в формате числа\n\n" \
                           "<b>Пример:</b>\n<code>12455</code>"
text_select_payment_method_issuance = "<b>Выдача в подотчет:</b> (шаг 4)\n\n👉 Выберите кошелек"
text_no_notify_groups = "Для начала пригласите бота хотя бы в одну группу 🤗\n" \
                        "Я отправлю туда сообщение с подтверждением операции 📩"
text_select_notify_group_issuance = "<b>Выдача в подотчет:</b> (шаг 5)" \
                                    "\n\n👉 Выберите группу, в которую нужно отправить уведомление"
text_end_issuance = "Отправил уведомление с подтверждением в группы 📨"
text_confirm_issuance_report = "Пользователь подтвердил получение под отчет ✅"
text_error_issuance = "Похоже бота удалили из выбранной группы, попробуйте выбрать другую 🅾️"
