text_start_write_new_report_type_user = f"<b>Табель</b>\n\n" \
                                        f"👉 Нажмите на сотрудника, которому нужно изменить отчетность по присутствию" \
                                        f" на работе. Запись будет внесена в таблицу." \
                                        f"\n" \
                                        f"<i>(При нажатии на сотрудника измениться его статус по порядку: 'не пришел' -> " \
                                        f"'на работе' -> 'ушел')</i>\n\n" \
                                        f"<i>⚠️ Важно: после 00:00 статусы сбрасываются, после отметки 'ушел' статус " \
                                        f"можно будет поменять снова уже только после 00:00</i>\n"
