text_start_add_client = f"<b>Добавление клиента</b>\n\n" \
                        f"<u>Введите следующие данные:</u>\n" \
                        f"<b>Chat_id</b> - id клиента телеграм\n" \
                        f"<b>Никнейм</b> - username клиента телеграм с @\n" \
                        f"<b>Полное имя</b> - полное имя клиента (Фамилия Имя Отчество)\n" \
                        f"<b>Ссылка на папку для чеков</b> - в формате строки\n" \
                        f"<b>Ссылка на таблицу</b> - в формате строки\n\n" \
                        f"<i>⚠️ Каждый параметр вводите с новой строки</i>\n\n" \
                        f"<b>Пример</b> (просто нажмите 👇):\n<code>" \
                        f"120400301202\n" \
                        f"@ivanov200\n" \
                        f"Иванов Иван Иванович\n" \
                        f"https://drive.google.com\n" \
                        f"https://docs.google.com/spreadsheets" \
                        f"</code>"
text_success_add_client = f"✅ Пользователь добавлен успешно"
text_success_error_add_client = f"⛔️ Пользователь уже зарегистрирован в системе"
